//Count Systems with Specific Vulnerability Severity That Are Outside of Acceptable Time to Remediation
//Note: Un-comment commented lines in querty to only query specific devices.

//let devices = dynamic(['system-name']);
DeviceTvmSoftwareVulnerabilitiesKB
| join DeviceTvmSoftwareVulnerabilities on CveId
//| where DeviceName in~ (devices)
| where (VulnerabilitySeverityLevel =~ "Critical" and PublishedDate < ago(7d))
| summarize Total = (count_distinct(DeviceId))
